<template>
  <div class="trajectoryMap-content-div" id="app">
    <!--手动点击显示轨迹-->
    <button  @click="changeMapFn">切换轨迹</button>

    <!--轨迹组件-->
    <div class="map-div">
      <gaode-trajectory-map  ref="gaodeTrajectoryMap" :data="mapData"/>
    </div>

  </div>
</template>

<script>
import GaodeTrajectoryMap from './components/GaodeTrajectoryMap/index.vue'
export default {
  name: 'trajectoryMap',
  data() {
    return {
      defaultData:[
        {
          "gtm": "20210818/143018",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143018",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143019",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143020",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143104",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143105",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143106",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143106",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143110",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143113",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143114",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143115",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/143116",
          "hgt": "500",
          "province": "北京市",
          "city": "北京市",
          "spd": "60.0",
          "agl": "0",
          "mlg": "1002.0",
          "lon": "116.34592",
          "location": "北京市海淀区花园路街道北京航空航天大学北京航空航天大学(学院路本部校区)",
          "lat": "39.978065"
        },
        {
          "gtm": "20210818/145810",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "75.0",
          "agl": "213",
          "mlg": "1913.0",
          "lon": "116.308334",
          "location": "安徽省安庆市太湖县晋熙镇G50沪渝高速",
          "lat": "30.415266"
        },
        {
          "gtm": "20210818/145820",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "104.0",
          "agl": "201",
          "mlg": "1916.0",
          "lon": "116.30225",
          "location": "安徽省安庆市太湖县晋熙镇G50沪渝高速",
          "lat": "30.403013"
        },
        {
          "gtm": "20210818/145830",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "79.0",
          "agl": "201",
          "mlg": "1919.0",
          "lon": "116.296616",
          "location": "安徽省安庆市太湖县城西乡G50沪渝高速",
          "lat": "30.39063"
        },
        {
          "gtm": "20210818/145840",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "80.0",
          "agl": "226",
          "mlg": "1922.0",
          "lon": "116.28952",
          "location": "安徽省安庆市太湖县城西乡G50沪渝高速",
          "lat": "30.37955"
        },
        {
          "gtm": "20210818/145850",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "76.0",
          "agl": "244",
          "mlg": "1925.0",
          "lon": "116.27647",
          "location": "安徽省安庆市太湖县城西乡G50沪渝高速",
          "lat": "30.37308"
        },
        {
          "gtm": "20210818/145900",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "62.0",
          "agl": "237",
          "mlg": "1928.0",
          "lon": "116.26552",
          "location": "安徽省安庆市太湖县城西乡G50沪渝高速",
          "lat": "30.36808"
        },
        {
          "gtm": "20210818/145910",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "90.0",
          "agl": "223",
          "mlg": "1931.0",
          "lon": "116.254456",
          "location": "安徽省安庆市太湖县城西乡G50沪渝高速",
          "lat": "30.36018"
        },
        {
          "gtm": "20210818/145920",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "80.0",
          "agl": "215",
          "mlg": "1934.0",
          "lon": "116.24561",
          "location": "安徽省安庆市太湖县城西乡G50沪渝高速",
          "lat": "30.35073"
        },
        {
          "gtm": "20210818/145930",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "76.0",
          "agl": "223",
          "mlg": "1937.0",
          "lon": "116.23659",
          "location": "安徽省安庆市宿松县凉亭镇G50沪渝高速",
          "lat": "30.340214"
        },
        {
          "gtm": "20210818/145940",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "84.0",
          "agl": "229",
          "mlg": "1940.0",
          "lon": "116.22594",
          "location": "安徽省安庆市宿松县凉亭镇G50沪渝高速",
          "lat": "30.33203"
        },
        {
          "gtm": "20210818/145950",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "76.0",
          "agl": "197",
          "mlg": "1943.0",
          "lon": "116.218025",
          "location": "安徽省安庆市宿松县凉亭镇G50沪渝高速",
          "lat": "30.323313"
        },
        {
          "gtm": "20210818/150000",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "101.0",
          "agl": "207",
          "mlg": "1949.0",
          "lon": "116.207146",
          "location": "安徽省安庆市宿松县河塌乡G50沪渝高速",
          "lat": "30.29753"
        },
        {
          "gtm": "20210818/150010",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "84.0",
          "agl": "221",
          "mlg": "1952.0",
          "lon": "116.19896",
          "location": "安徽省安庆市宿松县河塌乡G50沪渝高速",
          "lat": "30.287313"
        },
        {
          "gtm": "20210818/150020",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "91.0",
          "agl": "231",
          "mlg": "1955.0",
          "lon": "116.18731",
          "location": "安徽省安庆市宿松县河塌乡G50沪渝高速",
          "lat": "30.27848"
        },
        {
          "gtm": "20210818/150030",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "81.0",
          "agl": "224",
          "mlg": "1958.0",
          "lon": "116.175934",
          "location": "安徽省安庆市宿松县华亭镇G50沪渝高速",
          "lat": "30.269766"
        },
        {
          "gtm": "20210818/150040",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "90.0",
          "agl": "225",
          "mlg": "1961.0",
          "lon": "116.16545",
          "location": "安徽省安庆市宿松县华亭镇G50沪渝高速",
          "lat": "30.260513"
        },
        {
          "gtm": "20210818/150050",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "82.0",
          "agl": "227",
          "mlg": "1964.0",
          "lon": "116.154854",
          "location": "安徽省安庆市宿松县华亭镇G50沪渝高速",
          "lat": "30.25265"
        },
        {
          "gtm": "20210818/150100",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "85.0",
          "agl": "224",
          "mlg": "1967.0",
          "lon": "116.145226",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速",
          "lat": "30.243467"
        },
        {
          "gtm": "20210818/150110",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "90.0",
          "agl": "233",
          "mlg": "1970.0",
          "lon": "116.13372",
          "location": "安徽省安庆市宿松县华亭镇G50沪渝高速",
          "lat": "30.23533"
        },
        {
          "gtm": "20210818/150120",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "88.0",
          "agl": "231",
          "mlg": "1973.0",
          "lon": "116.121704",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速",
          "lat": "30.227167"
        },
        {
          "gtm": "20210818/150130",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "80.0",
          "agl": "198",
          "mlg": "1976.0",
          "lon": "116.114456",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速",
          "lat": "30.21695"
        },
        {
          "gtm": "20210818/150140",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "77.0",
          "agl": "191",
          "mlg": "1979.0",
          "lon": "116.11052",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速",
          "lat": "30.205667"
        },
        {
          "gtm": "20210818/150150",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "73.0",
          "agl": "183",
          "mlg": "1982.0",
          "lon": "116.10875",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速晨旺木业",
          "lat": "30.19488"
        },
        {
          "gtm": "20210818/150200",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "55.0",
          "agl": "184",
          "mlg": "1985.0",
          "lon": "116.10795",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速",
          "lat": "30.18415"
        },
        {
          "gtm": "20210818/150210",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "1988.0",
          "lon": "116.10763",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.181114"
        },
        {
          "gtm": "20210818/150220",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "3.0",
          "agl": "184",
          "mlg": "1991.0",
          "lon": "116.10763",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.181067"
        },
        {
          "gtm": "20210818/150230",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "3.0",
          "agl": "184",
          "mlg": "1994.0",
          "lon": "116.10763",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.181067"
        },
        {
          "gtm": "20210818/150240",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "1997.0",
          "lon": "116.10761",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.180967"
        },
        {
          "gtm": "20210818/150250",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2000.0",
          "lon": "116.10765",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.18098"
        },
        {
          "gtm": "20210818/150300",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "3.0",
          "agl": "186",
          "mlg": "2003.0",
          "lon": "116.10765",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.18095"
        },
        {
          "gtm": "20210818/150310",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2006.0",
          "lon": "116.10765",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.1808"
        },
        {
          "gtm": "20210818/150320",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "2.0",
          "agl": "0",
          "mlg": "2009.0",
          "lon": "116.1076",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.18058"
        },
        {
          "gtm": "20210818/150330",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "2.0",
          "agl": "0",
          "mlg": "2012.0",
          "lon": "116.1076",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.18055"
        },
        {
          "gtm": "20210818/150340",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2015.0",
          "lon": "116.107574",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.18055"
        },
        {
          "gtm": "20210818/150350",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2018.0",
          "lon": "116.1076",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.18065"
        },
        {
          "gtm": "20210818/150400",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "3.0",
          "agl": "0",
          "mlg": "2021.0",
          "lon": "116.107574",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.180613"
        },
        {
          "gtm": "20210818/150410",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2024.0",
          "lon": "116.107574",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.18058"
        },
        {
          "gtm": "20210818/150420",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "3.0",
          "agl": "0",
          "mlg": "2027.0",
          "lon": "116.10756",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.18055"
        },
        {
          "gtm": "20210818/150430",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "23.0",
          "agl": "189",
          "mlg": "2030.0",
          "lon": "116.10752",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速宿松服务区(沪渝高速上海方向)",
          "lat": "30.1795"
        },
        {
          "gtm": "20210818/150440",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2033.0",
          "lon": "116.107414",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速",
          "lat": "30.17888"
        },
        {
          "gtm": "20210818/150450",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2036.0",
          "lon": "116.107414",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速",
          "lat": "30.17883"
        },
        {
          "gtm": "20210818/150510",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2042.0",
          "lon": "116.10743",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速",
          "lat": "30.17885"
        },
        {
          "gtm": "20210818/150520",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "7.0",
          "agl": "183",
          "mlg": "2045.0",
          "lon": "116.107414",
          "location": "安徽省安庆市宿松县龙山街道G50沪渝高速",
          "lat": "30.17883"
        },
        {
          "gtm": "20210818/150530",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "52.0",
          "agl": "192",
          "mlg": "2048.0",
          "lon": "116.107",
          "location": "安徽省安庆市宿松县孚玉镇G50沪渝高速",
          "lat": "30.17593"
        },
        {
          "gtm": "20210818/150540",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "73.0",
          "agl": "196",
          "mlg": "2051.0",
          "lon": "116.10447",
          "location": "安徽省安庆市宿松县孚玉镇G50沪渝高速",
          "lat": "30.16633"
        },
        {
          "gtm": "20210818/150550",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "84.0",
          "agl": "199",
          "mlg": "2054.0",
          "lon": "116.09914",
          "location": "安徽省安庆市宿松县孚玉镇G50沪渝高速",
          "lat": "30.15423"
        },
        {
          "gtm": "20210818/150600",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "83.0",
          "agl": "187",
          "mlg": "2057.0",
          "lon": "116.095",
          "location": "安徽省安庆市宿松县孚玉镇G50沪渝高速",
          "lat": "30.14215"
        },
        {
          "gtm": "20210818/150610",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "64.0",
          "agl": "184",
          "mlg": "2060.0",
          "lon": "116.093895",
          "location": "安徽省安庆市宿松县孚玉镇G50沪渝高速石莲洞国家森林公园",
          "lat": "30.13133"
        },
        {
          "gtm": "20210818/150620",
          "hgt": "500",
          "province": "安徽省",
          "city": "安庆市",
          "spd": "83.0",
          "agl": "219",
          "mlg": "2063.0",
          "lon": "116.09012",
          "location": "安徽省安庆市宿松县佐坝乡G50沪渝高速石莲洞国家森林公园",
          "lat": "30.12133"
        },
        {
          "gtm": "20210818/150630",
          "hgt": "500",
          "province": "湖北省",
          "city": "黄冈市",
          "spd": "71.0",
          "agl": "273",
          "mlg": "2066.0",
          "lon": "116.076866",
          "location": "湖北省黄冈市黄梅县独山镇G50沪渝高速",
          "lat": "30.11945"
        },
        {
          "gtm": "20210818/150640",
          "hgt": "500",
          "province": "湖北省",
          "city": "黄冈市",
          "spd": "79.0",
          "agl": "273",
          "mlg": "2069.0",
          "lon": "116.063896",
          "location": "湖北省黄冈市黄梅县独山镇G50沪渝高速",
          "lat": "30.12013"
        },
        {
          "gtm": "20210818/150650",
          "hgt": "500",
          "province": "湖北省",
          "city": "黄冈市",
          "spd": "78.0",
          "agl": "274",
          "mlg": "2072.0",
          "lon": "116.06368",
          "location": "湖北省黄冈市黄梅县独山镇G50沪渝高速",
          "lat": "30.12015"
        },
        {
          "gtm": "20210818/150700",
          "hgt": "500",
          "province": "湖北省",
          "city": "黄冈市",
          "spd": "69.0",
          "agl": "257",
          "mlg": "2075.0",
          "lon": "116.052",
          "location": "湖北省黄冈市黄梅县独山镇G50沪渝高速",
          "lat": "30.11983"
        },
        {
          "gtm": "20210818/150710",
          "hgt": "500",
          "province": "湖北省",
          "city": "黄冈市",
          "spd": "86.0",
          "agl": "246",
          "mlg": "2078.0",
          "lon": "116.038506",
          "location": "湖北省黄冈市黄梅县独山镇G50沪渝高速",
          "lat": "30.114714"
        },
        {
          "gtm": "20210818/150720",
          "hgt": "500",
          "province": "湖北省",
          "city": "黄冈市",
          "spd": "6.0",
          "agl": "265",
          "mlg": "2081.0",
          "lon": "116.03316",
          "location": "湖北省黄冈市黄梅县独山镇G50沪渝高速界子墩服务区(沪渝高速上海方向)",
          "lat": "30.11253"
        },
        {
          "gtm": "20210818/150730",
          "hgt": "500",
          "province": "湖北省",
          "city": "黄冈市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2084.0",
          "lon": "116.0328",
          "location": "湖北省黄冈市黄梅县独山镇G50沪渝高速",
          "lat": "30.11243"
        },
        {
          "gtm": "20210818/150740",
          "hgt": "500",
          "province": "湖北省",
          "city": "黄冈市",
          "spd": "3.0",
          "agl": "230",
          "mlg": "2087.0",
          "lon": "116.032745",
          "location": "湖北省黄冈市黄梅县独山镇G50沪渝高速",
          "lat": "30.112413"
        },
        {
          "gtm": "20210818/150750",
          "hgt": "500",
          "province": "湖北省",
          "city": "黄冈市",
          "spd": "0.0",
          "agl": "0",
          "mlg": "2090.0",
          "lon": "116.0326",
          "location": "湖北省黄冈市黄梅县独山镇G50沪渝高速",
          "lat": "30.11235"
        }
      ],
      mapData:[],
      changeMapData:[]
    }
  },
  components: {
    GaodeTrajectoryMap
  },
  computed: {},
  created() {
    this.reloadFn()
  },
  mounted() {
  },
  methods: {
    changeMapFn(){
      this.mapData = JSON.parse(JSON.stringify(this.changeMapData[Math.floor(Math.random() * 4)]))
    },
    reloadFn(){
      let that = this
      setTimeout(function(){
        that.changeMapData = [
          JSON.parse(JSON.stringify(that.defaultData.slice(0, 20))),
          JSON.parse(JSON.stringify(that.defaultData.slice(20, 40))),
          JSON.parse(JSON.stringify(that.defaultData.slice(40, 80))),
          JSON.parse(JSON.stringify(that.defaultData.slice(80, 120))),
          JSON.parse(JSON.stringify(that.defaultData.slice(120, 160))),
        ]
        that.mapData = JSON.parse(JSON.stringify(that.changeMapData[0]))
      },1000)
    },
  },
  watch: {}
}
</script>

<style scoped>
.map-div{
  margin-top: 15px;
  height: calc(100vh - 160px);

}
.container-map-div{
  height: calc(100vh - 160px)!important;
  width: calc(100vw - 230px)!important;
}
</style>
